# Question1:

step1:open a excel, and put in the data as requirement,then keep as .txt, upload this csv to github.

step2:when load the CSV in the github from here, we need be careful that the link was 'raw'.

In [101]:
import pandas as pd

In [102]:
import pandas as pd
import pandas as pd
frame = pd.read_csv("https://raw.githubusercontent.com/YALINYAN-YU/DAV5400/master/Tidying%20and%20Transforming%20Data.csv")
frame

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497.0,221.0,212.0,503.0,1841.0
1,NaN,delayed,62.0,12.0,20.0,102.0,305.0
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AMWEST,on time,694.0,4840.0,383.0,320.0,201.0
4,NaN,delayed,117.0,415.0,65.0,129.0,61.0

# Question2:

use the reshaping/transformational steps must include converting the above table to a “tidy” long format.

In [103]:
#clear the third row of this dataframe
frame = frame.dropna(how = 'all')
frame

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497.0,221.0,212.0,503.0,1841.0
1,NaN,delayed,62.0,12.0,20.0,102.0,305.0
3,AMWEST,on time,694.0,4840.0,383.0,320.0,201.0
4,NaN,delayed,117.0,415.0,65.0,129.0,61.0

In [104]:
#name the columns as what it should be. there are many ways to come true this result, the following 
#rename all is a little bit troblesome but very clear.
frame.columns = ['airflight','type','Los Angeles','Phoenix','San Diego','San Francisco','Seattle']
frame

  airflight     type  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0    ALASKA  on time        497.0    221.0      212.0          503.0   1841.0
1       NaN  delayed         62.0     12.0       20.0          102.0    305.0
3    AMWEST  on time        694.0   4840.0      383.0          320.0    201.0
4       NaN  delayed        117.0    415.0       65.0          129.0     61.0

In [105]:
#change the NaN to what it should be, fulfill the missing data here.

frame.loc[1,'airflight'] = 'ALASKA'
frame.loc[4,'airflight'] = 'AMWEST'
frame

  airflight     type  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0    ALASKA  on time        497.0    221.0      212.0          503.0   1841.0
1    ALASKA  delayed         62.0     12.0       20.0          102.0    305.0
3    AMWEST  on time        694.0   4840.0      383.0          320.0    201.0
4    AMWEST  delayed        117.0    415.0       65.0          129.0     61.0

In [106]:
#refresh the index start from 0 to the lenth of the dataframe
frame.index = range(len(frame))
frame

  airflight     type  Los Angeles  Phoenix  San Diego  San Francisco  Seattle
0    ALASKA  on time        497.0    221.0      212.0          503.0   1841.0
1    ALASKA  delayed         62.0     12.0       20.0          102.0    305.0
2    AMWEST  on time        694.0   4840.0      383.0          320.0    201.0
3    AMWEST  delayed        117.0    415.0       65.0          129.0     61.0

In [143]:
#keep the columns'airflight' and 'type' as the original use 'id_vars=';and the rest city columns all need to transfer, so we dont need to use 
#'value_vars='here,rename the variables as 'city' and the value name as 'times' 
new_frame = pd.melt(frame,id_vars=['airflight','type'], var_name='city', value_name='times')
new_frame

   airflight     type           city   times
0     ALASKA  on time    Los Angeles   497.0
1     ALASKA  delayed    Los Angeles    62.0
2     AMWEST  on time    Los Angeles   694.0
3     AMWEST  delayed    Los Angeles   117.0
4     ALASKA  on time        Phoenix   221.0
5     ALASKA  delayed        Phoenix    12.0
6     AMWEST  on time        Phoenix  4840.0
7     AMWEST  delayed        Phoenix   415.0
8     ALASKA  on time      San Diego   212.0
9     ALASKA  delayed      San Diego    20.0
10    AMWEST  on time      San Diego   383.0
11    AMWEST  delayed      San Diego    65.0
12    ALASKA  on time  San Francisco   503.0
13    ALASKA  delayed  San Francisco   102.0
14    AMWEST  on time  San Francisco   320.0
15    AMWEST  delayed  San Francisco   129.0
16    ALASKA  on time        Seattle  1841.0
17    ALASKA  delayed        Seattle   305.0
18    AMWEST  on time        Seattle   201.0
19    AMWEST  delayed        Seattle    61.0

# Question3:
    
I choose to answer the question"Which airline had the best overall on time performance?" to do the analysis of the tidy dataframe.

In [135]:
#to get the total flight times of ALASKA
ALASKA_total=new_frame[(new_frame['airflight']=='ALASKA')]['times'].sum()
ALASKA_total

3775.0

In [134]:
##to get the total on time flight times of ALASKA
ALASKA_on_time=new_frame[(new_frame['airflight']=='ALASKA')&(new_frame['type']=='on time')]['times'].sum()
ALASKA_on_time

3274.0

In [136]:
#to get the total flight times of AMWEST
AMWEST_total=new_frame[(new_frame['airflight']=='AMWEST')]['times'].sum()
AMWEST_total

7225.0

In [137]:
#to get the total on time flight times of AMWEST
AMWEST_on_time=new_frame[(new_frame['airflight']=='AMWEST')&(new_frame['type']=='on time')]['times'].sum()
AMWEST_on_time

6438.0

In [138]:
#calculate the on time rate of ALASKA
ALA_rate = ALASKA_on_time/ALASKA_total
print(ALA_rate)

0.8672847682119206

In [139]:
#calculate the on time rate of AMWEST
AMW_rate = AMWEST_on_time/AMWEST_total
print(AMW_rate)

0.8910726643598615

# Analysis1:

now we can compare the overall on time rate of ALASKA and AMWEST, AMW_rate is higer than ALA_rate, so AMWEST have a overall better performance.

In [155]:
#For question " For each city, which airline had the best on time performance?",we use the same way as above, can calculate the the 
#on time rate of two airflight company and compare and analysis which one's on time rate is higher.
#For ALASKA in LA, the on time rate as follows:
ALASKA_on_time_LA=new_frame[(new_frame['airflight']=='ALASKA')&(new_frame['type']=='on time')&(new_frame['city']=='Los Angeles')]['times'].sum()

ALASKA_total_LA=new_frame[(new_frame['airflight']=='ALASKA')&(new_frame['city']=='Los Angeles')]['times'].sum()

ALA_LA_ontime=ALASKA_on_time_LA/ALASKA_total_LA

ALA_LA_ontime

0.889087656529517

In [156]:
#For AMWEST in LA, the on time rate as follows:
AMWEST_on_time_LA=new_frame[(new_frame['airflight']=='AMWEST')&(new_frame['type']=='on time')&(new_frame['city']=='Los Angeles')]['times'].sum()
AMWEST_on_time_LA

AMWEST_total_LA=new_frame[(new_frame['airflight']=='AMWEST')&(new_frame['city']=='Los Angeles')]['times'].sum()
AMWEST_total_LA

AMW_LA_ontime=AMWEST_on_time_LA/AMWEST_total_LA

AMW_LA_ontime

0.8557336621454994

# Analysis2:
So we know here for LA, the ALASKA have a better on time rate, in the same way, we can analysis the other cities for these two companies 
performance compare.

# Question4

Transform the“long” data to “wide” format.

The result has no missing information and also have a 'airflight' and 'type' for the first and second columns , this makes the current “wide” presentation easier to understand and work with.

In [171]:
#transform the“long” data to “wide” format by using pivot_table here
import pandas as pd
mdd = pd.DataFrame(pd.pivot_table(new_frame, index = ['airflight','type'],columns = 'city', values = 'times'))
mdd

city               Los Angeles  Phoenix  San Diego  San Francisco  Seattle
airflight type
ALASKA    delayed         62.0     12.0       20.0          102.0    305.0
          on time        497.0    221.0      212.0          503.0   1841.0
AMWEST    delayed        117.0    415.0       65.0          129.0     61.0
          on time        694.0   4840.0      383.0          320.0    201.0